bundles/org.openhab.binding.ihc/src/test/resources/GetSystemInfoResponse.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Body>
<ns1:getSystemInfo1 xmlns:ns1="utcs" xsi:type="ns1:WSSystemInfo">
<ns1:uptime xsi:type="xsd:long">3980146956</ns1:uptime>

<ns1:realtimeclock xsi:type="xsd:dateTime">2018-06-28T17:02:29Z</ns1:realtimeclock>

<ns1:serialNumber xsi:type="xsd:string">1234567890</ns1:serialNumber>

<ns1:productionDate xsi:type="xsd:dateTime">2011-04-28T09:00:00Z</ns1:productionDate>

<ns1:brand xsi:type="xsd:string">ELKOFI</ns1:brand>

<ns1:version xsi:type="xsd:string">2.7.144</ns1:version>

<ns1:hwRevision xsi:type="xsd:string">6.2</ns1:hwRevision>

<ns1:swDate xsi:type="xsd:dateTime">2011-03-04T09:00:00Z</ns1:swDate>

<ns1:applicationIsWithoutViewer xsi:type="xsd:boolean">false</ns1:applicationIsWithoutViewer>
</ns1:getSystemInfo1>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>